package com.gwghk.ims.monitor.notice;

/**
 * 摘要：Gw基础服务 Api response code
 * @author Gavin.guo
 * @version 1.0
 * @Date 2016年12月12日
 */
public enum GwApiResultCode{
	OK("0", "请求成功"),
	/**系统繁忙，此时请开发者稍候再试！*/
	FAIL("-1", "系统繁忙，此时请开发者稍候再试"),
	/**系统异常 */
	EXCEPTION("-1", "系统异常"),
	/**参数格式不对，请检查！*/
	E10001("10001", "参数格式不对，请检查！"),
	/**姓名与身份证号码不符，请检查后重新输入 */
	E10002("10002","姓名与身份证号码不符，请检查后重新输入"),
	/**姓名或手机号与身份证号码不符，请检查后重新输入 */
	E10003("10003","姓名或手机号与身份证号码不符，请检查后重新输入"),
	/** 姓名与银行账号不符，请重新输入 */
	E10004("10004","姓名与银行账号不符，请重新输入"),
	/**身份证号码校验不正确*/
	E10005("10005","身份证号码校验不正确。"),
	/**系统配置的所有供应商-手机实名认证接口认证失败，请联系后台管理员!*/
	E10006("10006","系统配置的所有供应商-手机实名认证接口认证失败，请联系后台管理员!"),
	/**系统配置的所有供应商身份证实名认证接口认证失败，请联系后台管理员!*/
	E10007("10007","系统配置的所有供应商-身份证实名认证接口认证失败，请联系后台管理员!"),
	/**请检查后台配置参数信息!*/
	E10008("10008","请检查后台配置参数信息!"),
	/** 记录已经存在！ */
	E10009("10009","记录已经存在！"),
	/**读取邮件模板文件出错！*/
	E40002("40002", "读取邮件模板文件出错！"),
	/**邮件模板文件没有上传！*/
	E40003("40003", "邮件模板没有上传！"),
	/**缺少邮件配置参数*/
	E40004("40004", "缺少邮件配置参数！"),
	/**发送邮件失败，系统错误！*/
	E40005("40005", "发送邮件失败，系统错误！"),
	/**没有收件人*/
	E40006("40006", "没有收件人！"),
	/**邮件服务器出错！*/
	E40007("40007", "邮件服务器出错！"),
	/**调用合一道银行卡接口异常！*/
	E50002("50002", "调用合一道银行卡接口异常！"),
	/**读取银行卡文件信息成功，上传到文件服务器失败！*/
	E50003("50003", "读取银行卡文件信息成功，上传到文件服务器失败！"),
	/**调用合一道身份证正面信息接口异常！*/
	E50004("50004", "调用合一道身份证正面信息接口异常！"),
	/**读取身份证正面文件信息成功，上传到文件服务器失败！*/
	E50005("50005", "读取身份证正面文件信息成功，上传到文件服务器失败！"),
	/**文件服务器出错，上传失败！*/
	E60002("60002", "文件服务器出错，上传失败！"),
	/**短信模板文件没有上传！*/
	E70001("70001", "短信模板没有上传！"),
	/**发送短信失败，系统错误！*/
	E70002("70002", "发送短信失败，系统错误！"),
	/**没有相关的短信设置！*/
	E70003("70003", "没有相关的短信设置！"),
	/**在ip黑名单中！*/
	E70004("70004", "客户IP地址在IP黑名单中！"),
	/**在ip黑名单中！*/
	E70005("70005", "%s分钟内发送短信超过限制(%s条)！"),
	/**短信模版code已存在！*/
	E70006("70006", "短信模版Code已存在，请重新输入！"),
	/**手机号在黑名单中！*/
	E70007("70007", "手机号在黑名单中！"),
	/**验证不通过，请联系客服！*/
	E70008("70008", "验证不通过，请联系客服！"),
	/**获取序列号失败，系统错误！*/
	E80001("80001", "获取序列号失败，系统错误！"),
	/**获取服务端ip 失败！*/
	E90001("90001", "获取服务端IP失败！"),
	/**获取token失败，请检查参数是否正确！*/
	E100001("100001", "获取token失败，请检查参数是否正确！"),
	/**token验证不通过，请检查参数是否正确！*/
	E100002("100002", "token验证不通过，请检查参数是否正确！"),
	/**生成二维码失败！*/
	E110001("110001", "生成二维码失败！"),
	/**对不起,请先登录后再操作！*/
    E20018("20018", "对不起,请先登录后再操作！"),
    /**该浏览器不支持,请换浏览器再试！*/
    E20019("20019", "该浏览器不支持,请换浏览器再试！"),
    E20020("20020", "该聚合供应商已存在，请重新输入！"),
    E20021("20021", "该短信供应商已存在，请重新输入！"),
    E20022("20022", "该短信防刷规则已存在，请重新输入！"),
    E20023("20023", "该短信应用方已存在，请重新输入！"),
    E20024("20024", "该供应商已在应用方配置中使用，请先删除相关的应用方配置！"),
    E20025("20025", "该邮箱应用方已存在，请重新输入！"),
    E20026("20026", "该邮箱模板已存在，请重新输入！"),
    ErrorFileMaxSize("ErrorFileMaxSize","上传文件最大为5M"),
	;
	
	private String code;
	private String message;

	private GwApiResultCode(String code, String message) {
		this.code = code;
		this.message = message;
	}

	public String getCode() {
		return code;
	}

	public void setCode(String code) {
		this.code = code;
	}
	
	public String getMessage() {
		return message;
	}

	public void setMessage(String message) {
		this.message = message;
	}
}